//==========================================================
// cmdproc.h
//==========================================================
// コマンドラインの解析機能の提供
// ---------------------------------------------------------
// 依存関係 :
// ・cmnctrl.h   [子]
// ・resource.h  [子]
// ・storectrl.h [子]
// ・type.h      [子]
//==========================================================


#ifndef _CMDPROC_H_
#define _CMDPROC_H_

#define STRICT
#define WIN32_LEAN_AND_MEAN


/* Windows32 API Header */
#include <windows.h>
#include <tchar.h>
#include <shellapi.h>

/* Standard API Header */
#include <stdio.h>

/* Other API & Resource Header */
#include "cmnctrl.h"
#include "resource.h"
#include "storectrl.h"
#include "type.h"

//==========================================================
// 各種マクロ
//==========================================================
#define COMMAND_LINE_MAX 60	//コマンドラインの最大文字数
#define COMMAND_LEN 6		//コマンドの最大文字数
#define SPLIT_MAX 10		//コマンドの最大分割数


//==========================================================
// コマンドプロシージャ
//==========================================================
BOOL CmdProc(HWND, FLAG_INFO*, FILE_INFO*, SETTING_INFO*, SYSTEMTIME*, LPCTSTR);
// ---------------------------------------------------------
// arg1 : ダイアログウィンドウハンドル
// arg2 : フラグ情報構造体へのポインタ
// arg3 : ファイルハンドル構造体へのポインタ
// arg4 : 設定情報構造体へのポインタ
// arg5 : 時間構造体へのポインタ
// arg6 : コマンドライン
// ---------------------------------------------------------
// rev	: コマンドライン成功でTRUE、失敗でFALSE
//==========================================================

#endif