//==========================================================
// storectrl.h
//==========================================================
// レジシステムの主要機能の提供
// ---------------------------------------------------------
// 依存関係 :
// ・cmnctrl.h   [子]
// ・csvreader.h [子]
// ・resource.h  [子]
// ・tsqlite3.h  [子]
// ・type.h      [子]
// ・cmdproc.h   [親]
//==========================================================


#ifndef _STORECTRL_H_
#define _STORECTRL_H_

#define STRICT
#define WIN32_LEAN_AND_MEAN


/* Windows32 API header */
#include <windows.h>
#include <tchar.h>

/* Standard API Header */
#include <stdio.h>
#include <stdlib.h>

/* Other API & Resource Header */
#include "cmnctrl.h"
#include "csvreader.h"
#include "resource.h"
#include "tsqlite3.h"
#include "type.h"

//==========================================================
// 各種マクロ
//==========================================================
#define ADD_TAX_BORDER 100		// 税率を適用する最低価格
#define TAX_MAX 500				// 最大税分
#define DEF_TAX_MAX_PRICE 5000	// 最大税分適用開始価格


//==========================================================
// 商品売却
//==========================================================
BOOL SellStock(HWND, FILE_INFO*, SETTING_INFO*, LPCTSTR, int, int, int);
// ---------------------------------------------------------
// arg1 : ダイアログウィンドウハンドル
// arg2 : ファイルハンドル構造体へのポインタ
// arg3 : 設定情報構造体へのポインタ
// arg4 : タグ文字列
// arg5 : 売却個数
// arg6 : 時間帯番号
// arg7 : 価格番号
// ---------------------------------------------------------
// rev	: 売却成功でTRUE、失敗でFALSE
//==========================================================

//==========================================================
// 商品情報取得
//==========================================================
BOOL GetStockInfo(HWND, sqlite3*, LPCTSTR);
// ---------------------------------------------------------
// arg1 : ダイアログウィンドウハンドル
// arg2 : データベースハンドル
// arg3 : タグ文字列
// ---------------------------------------------------------
// rev	: 取得成功でTRUE、失敗でFALSE
//==========================================================

//==========================================================
// 商品情報登録
//==========================================================
BOOL SetStockInfo(HWND, FILE_INFO*, STOCK_INFO*);
// ---------------------------------------------------------
// arg1 : ダイアログウィンドウハンドル
// arg2 : ファイルハンドル構造体へのポインタ
// arg3 : 商品情報構造体へのポインタ
// ---------------------------------------------------------
// rev	: 登録成功でTRUE、失敗でFALSE
//		: (ただし成功の場合もオートコンプリートONならFALSE)
//==========================================================

//==========================================================
// 商品情報更新
//==========================================================
BOOL UpdateStockInfo(HWND, FILE_INFO*, STOCK_INFO*);
// ---------------------------------------------------------
// arg1 : ダイアログウィンドウハンドル
// arg2 : ファイルハンドル構造体へのポインタ
// arg3 : 商品情報構造体へのポインタ
// ---------------------------------------------------------
// rev	: 更新成功でTRUE、失敗でFALSE
//==========================================================

//==========================================================
// 商品返品
//==========================================================
BOOL ReshopStock(HWND, FILE_INFO*, SETTING_INFO*, LPCTSTR, int, int);
// ---------------------------------------------------------
// arg1 : ダイアログウィンドウハンドル
// arg2 : ファイルハンドル構造体へのポインタ
// arg3 : 設定情報構造体へのポインタ
// arg4 : タグ文字列
// arg5 : 時間帯番号
// arg6 : 購入価格(税込み)
// ---------------------------------------------------------
// rev	: 返品成功でTRUE、失敗でFALSE
//==========================================================

//==========================================================
// 商品削除
//==========================================================
BOOL DeleteStock(HWND, FILE_INFO*, LPCTSTR);
// ---------------------------------------------------------
// arg1 : ダイアログウィンドウハンドル
// arg2 : ファイルハンドル構造体へのポインタ
// arg3 : 商品情報構造体へのポインタ
// ---------------------------------------------------------
// res	: 削除成功でTRUE、失敗でFALSE
//==========================================================

//==========================================================
// 商品リスト読込
//==========================================================
BOOL ImportItemList(HWND, FILE_INFO*);
// ---------------------------------------------------------
// arg1 : ダイアログウィンドウハンドル
// arg2 : ファイルハンドル構造体へのポインタ
// ---------------------------------------------------------
// rev	: 読込成功でTRUE、失敗でFALSE
//==========================================================

//==========================================================
// 商品リスト書出し
//==========================================================
BOOL ExportItemList(HWND, FILE_INFO*);
// ---------------------------------------------------------
// arg1 : ダイアログウィンドウハンドル
// arg2 : ファイルハンドル構造体へのポインタ
// ---------------------------------------------------------
// rev	: 書出し成功でTRUE、失敗でFALSE
//==========================================================

//==========================================================
// レシート印字
//==========================================================
BOOL PrintReceipt(HWND, FILE_INFO*, SETTING_INFO*, SYSTEMTIME*, LPCTSTR);
// ---------------------------------------------------------
// arg1 : ダイアログウィンドウハンドル
// arg2 : ファイルハンドル構造体へのポインタ
// arg3 : 設定情報構造体へのポインタ
// arg4 : 時間構造体へのポインタ
// arg5 : 実行モード
// ---------------------------------------------------------
// rev	: 印字成功でTRUE、失敗でFALSE
//==========================================================

#endif